---
kind: property
id: P:Autodesk.Revit.DB.CurveLoopIterator.CurrentObject
source: html/52555213-9b74-4596-fb98-baaab878874f.htm
---
# Autodesk.Revit.DB.CurveLoopIterator.CurrentObject Property

## Syntax (C#)
```csharp
internal Object CurrentObject { get; }
```